In [2]:
import pandas as pd
import numpy as np

In [3]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',np.nan]}

dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [4]:
d1=pd.DataFrame(dict1)

In [5]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [6]:
dict2={'Names':['Aravind','Samar',None,'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',None]}

pd.DataFrame(dict2)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [7]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [10]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

- np.nan: not a number this applicable for numerical column only

- Generally data has some empty rows

-  It is a data problem

-  If you read that kind of data you will see Null

-  You need to understand it is a data corrupted or really a Null values are there

In [ ]:
**Method-1**

**Fill with some random value**

**Method name:** fill na

In [12]:
d1.fillna()

ValueError: Must specify a fill 'value' or 'method'.

**Method-2**

- We can fill the values w.r.t columns also

In [14]:
d1['Age'].fillna(40)

# it will not updated 
# inplace=False

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [15]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [17]:
d1['Age'].fillna(40,inplace=True)
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [20]:
d1['Names'].fillna('Shubham',inplace=True)
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2  Shubham  32.0  Chennai
3     Siri  43.0      NaN

In [21]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2  Shubham  32.0  Chennai
3     Siri  43.0      NaN

In [ ]:
dict2={'Names':['Aravind','Samar',None,'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',None]}

pd.DataFrame(dict2)